dev/playgrounds/ground1/public/benchmark.yml
config:
  target: 'http://localhost:2000' # Replace with your API endpoint
  phases:
    - duration: 1000 # Test duration in seconds
      arrivalRate: 1000 # Number of requests per second (concurrent users)

scenarios:
  - flow:
      - get:
          url: '/api/v1/hello' # Replace with your API's endpoint